START
(8:00AM) W Germany vs. W Russia
Germany +2.5 (-154)
Russia -2.5 (+100)
- This will be the first game of the Olympics for both nations
- Russia are 3-2 in their last five games
- Germany are 0-5 in their last five games
- Russia are 5-0 in their last five games versus Germany (4 won by 3+ goals)
- Russia are 4-1 in their last five home games (If you want to consider this a home game)
- Germany have not done well versus Russia in the past, and with the Russians being the hosts I think they will want to beat the Germans well.
Pick: Russia Wins by 3+ Goals
END



(11:00AM) Fulham @ Manchester United
Manchester United -1.5 (-198)
Fulham +1.5 (+157)
- Manchester United: 12-4-8 overall, 6-2-4 at home, +10 goal differential
- Fulham: 6-1-17 overall, 3-0-9 on the road,  -31 goal differential
-Manchester United are 2-1-2 in their last five matches
- Fulham are 0-1-4 in their last five matches
- Man U are 5-0-0 in their last five matches versus Fulham (3 won by 2+ goals)
- Man U 2-1-2 in their last five HOME matches
- Fulham 0-2-3 in their last five ROAD matches
- Manchester United have been tough to trust on SFTC lately, this would be embarrassing for them if they did not beat Fulham by atleast two goals.
Pick: Manchester United Wins by 2+ Goals

(1:05PM) Knicks @ Thunder
Thunder -9.5 (-105)
Knicks +9.5 (-110)
- Knicks: 20-30 overall, 8-13 on the road
- Thunder: 40-12 overall, 22-3 at home
- Knicks are scoring 97.2 PPG while allowing 98.7 PPG
- Thunder are scoring 104.9 PPG while allowing 97.5 PPG
- Knicks are 5-5 in their last ten games
- Thunder are 8-2 in their last ten games
- The Knicks played great in their last game versus the Nuggets, beating them by 17 points at MSG. The Thunder are coming off of a rough game versus the Magic, a one point buzzer beater loss.
- This one seems like it may be a lot closer than you'd think, with the Thunder still winning in the end
Pick: Knicks Win or Single Digit Loss


(1:05PM) #9 Michigan State @ Wisconsin
Wisconsin -154
Michigan State +125
- Michigan State: 20-3 overall, 6-0 on the road
- Wisconsin: 18-5 overall, 10-3 at home
- Michigan State are scoring 78.5 PPG while allowing 65.0 PPG
- Wisconsin are scoring 73.6 PPG while allowing 63.3 PPG
- Harris (MSU) is scoring 18.2 PPG for the Spartans
- Dekker (WIS) is scoring 13.7 PPG 
- I like Wisconsin to be pumped up to play at home, and I think they pull off the upset rankings-wise, even though they are actually favored in the lines.
Pick: Wisconsin
